# 2 Тип заданий
# Задание 27531

Код для нахождения ответа в таблице

```
for w in range(2):
    for x in range(2):
        for y in range(2):
             for z in range(2):
                F = int((x <= y) and (y == (not z)) and (z or w))
                if F == 1:
                    print(w, x, y, z,"|", F)
```
Что выведет код:

w x y z   f

0 0 0 1 | 1

1 0 0 1 | 1

1 0 1 0 | 1

1 1 1 0 | 1

* `Правильный ответ:ywzx`

# Задание №55589

Код для нахождения ответа при помощи цикла в цикле
```
for w in range(2):
    for x in range(2):
        for y in range(2):
             for z in range(2):
                F1 = int((x <= y) == (w or not z))
                F2 = int((x <= y) and (not w == z))
                print(w, x, y, z,"|", F1, F2)
```
* `Какой ответ выйдет:`

0 0 0 0 | 1 0

0 0 0 1 | 0 1

# Задание 75266

Код для нахождения ответа для ответа
```
for w in range(2):
    for x in range(2):
        for y in range(2):
             for z in range(2):
                F = int(x <= (not(y == w) and (y or (w <= z))))
                if F == 0:
                    print(w, x, y, z,"|", F)
```
Что выведет код:

w x y z   f

0 1 0 0 | 0

0 1 0 1 | 0

1 1 0 0 | 0

1 1 1 0 | 0

1 1 1 1 | 0

* `Правильный ответ:
z w y x`

# 8 Тип заданий
# Задание 16886
## Матвей составляет 6-⁠буквенные коды из букв М, А, Т, В, Е, Й. Каждую букву нужно использовать ровно 1 раз, при этом код не может начинаться с буквы Й и не может содержать сочетания АЕ. Сколько различных кодов может составить Матвей?
```
c = "Матвей"
k = 0
for i in c:
    for j in c:
        for a in c:
            for b in c:
                for w in c:
                    for h in c:
                        s = i + j + a + b + w + h
                        bb = set(s)
                        if len(s) == len(bb) and s.count('АЕ') == 0:
                            k += 1
print(k)
```
* `Ответ: 720`

# 8 тип задания 18491
## Ольга составляет 5-⁠буквенные коды из букв О, Л, Ь, Г, А. Каждую букву нужно использовать ровно 1 раз, при этом Ь нельзя ставить первым и нельзя ставить после гласной. Сколько различных кодов может составить Ольга?

```
a1=['о','л','г','а']
a=['о','л','г','а','ь']
k=0
for b1 in a1:
    for b2 in a:
        for b3 in a:
            for b4 in a:
                for b5 in a:
                    s=b1+b2+b3+b4+b5
                    if s.count('о')==1 and s.count('л')==1 and s.count('ь')==1 and s.count('г')==1 and s.count('а')==1 :
                        if not('оь') in s and not('аь') in s:
                            k+=1
print(k)
```
* `ответ:48`
# Задание 7986
## Сколько слов длины 5, начинающихся с согласной буквы и заканчивающихся гласной буквой, можно составить из букв З, И, М, А? Каждая буква может входить в слово несколько раз. Слова не обязательно должны быть осмысленными словами русского языка.

```
c = "ЗИМА"
count = 0
for i in c:
    for j in c:
        for a in c:
            for b in c:
                for w in c:
                    for h in c:
                        s = i + j + a + b + w + h
                        if (s[0] == 'З' or s[0] == 'М') and (s[4] == 'И' or s[4] == 'А'):
                            count += 1
print(count)
```
* `Ответ 1024`
