# 1 Тип задания
## 1 Иттерация
```
n = int(input()) #вводится любая переменная в строку
r = bin(n) #переводит переменную в двоичную систему 
print(r) #выводит результат на экран
```
Для примера вводим число 50, вот, что выведет код:
* `Число: 50`
* `0b110010`
## 2 Иттерация
Нам нужно избавиться от лишних симовлов в результате, что мы для этого добавляем в код:
```
n = int(input()) #Здесь ничего пока не меняем
r = bin(n)[2:] #Здесь добавляем двойку в квадратные скобки чтобы избавится от 0b
print(r) #выводит результат на экран
if n % 2 == 0: #если переменная в n будет четным при делен на 2 то:
    r += '01' #к перменной r в конце добавляем 01
else: #иначе если пременная n нечетное то:
    r +='10' #к перменной r в конце добавляем 10
print(r) #выводит итоговый ответ после кода
```
После того как мы внесли изменения, теперь ответ будет выводить:
* `Число: 50`
* `110010`
* `11001001`
## 3 Иттерация
```
for n in range(1, 100): #для все чисел в диапозоне от 1 до 100 выполняется следующие команды
    r = bin(n)[2:] #переводит все числа в диапозоне в двоичную систему
    if n % 2 == 0:
        r += '01'
    else:
        r +='10'
    print(n, int(r)) #выводит все числа диапозона от 1 до 100 и выводих их двоичную систему
```









На вход алгоритма подаётся натуральное число №. Алгоритм строит по нему новое число В следующим образом.
1) Строится двоичная запись числа №.
2) К этой записи дописывается справа бит чётности: 0, если в двоичном коде числа № было чётное число единиц, и 1, если нечётное.
3) К полученному результату дописывается ещё один бит четности.
Полученная таким образом запись (в ней на два разряда больше, чем в записи исходного числа №) является двоичной записью искомого числа В. Укажите минимальное число №, после обработки которого с помощью этого алгоритма получается число, большее, чем 184. В ответе это число запишите в десятичной системе.
```
n = int(input()) #вводится переменная в строку
r = bin(n)[2:] #переводит переменную в двоичную систему без лишних символов
print(r) #выводит число на экран
if r.count ('1') % 2 == 0: #определяется количество чисел, если количество чисел четное то:
    r += '0' #к переменной r прибавляется 0
else: #иначе если число нечетное:
    r += '1' #к переменной r прибавляется 1
if r.count('1') % 2 == 0: #определяется количество чисел, если количество чисел четное то:
    r += '0' #к переменной r прибавляется 0
else: #иначе если число нечетное:
    r += '1' #к переменной r прибавляется 1
print(r) #выводит полученный результат после кода
```
Пример: вводим число 
