# Тип Задания - 2
## Задание  28677
Логическая функция F задаётся выражением ((x → y) ∨ (y ≡ w)) ∧ ((x ∨ z) ≡ w). На рисунке приведён частично заполненный фрагмент таблицы истинности функции F, содержащий неповторяющиеся строки. 
Определите, какому столбцу таблицы истинности функции F соответствует каждая из переменных x, y, z, w.
```
for x in range(2):
    for y in range(2):
        for z in range(2):
            for w in range(2):
                if  ((x <= y) or (y >= w)) and ((x or z ) >=w):
                        print(x, y, z, w)
```
## Задание  15124 
Логическая функция F задаётся выражением (x ≡ y ) ∨ ((y ∨ z) → x).Дан частично заполненный фрагмент, содержащий неповторяющиеся строки таблицы истинности функции F.
```
for x in range(2):
    for y in range(2):
        for z in range(2):
            if not ((x == y) or ((y or z) <= x)):
                print(x, y, z)
```
Определите, какому столбцу таблицы истинности соответствует каждая из переменных x, y, z.
В ответе напишите буквы x, y, z в том порядке, в котором идут соответствующие им столбцы (сначала  — буква, соответствующая первому столбцу; затем  — буква, соответствующая второму столбцу, и т. д.). Буквы в ответе пишите подряд, никаких разделителей между буквами ставить не нужно.

 ## Задание  26974
 Логическая функция F задаётся выражением (x ∨ y) ∧ ¬(y ≡ z) ∧ ¬w. На рисунке приведён частично заполненный фрагмент таблицы истинности функции F, содержащий неповторяющиеся строки. Определите, какому столбцу таблицы истинности функции F соответствует каждая из переменных x, y, z, w.
```
for x in range(2):
    for y in range(2):
        for z in range(2):
            for w in range(2):
                if ((x or y) and not (y == z) and not w):
                    print(x, y, z, w)
```
В ответе напишите буквы x, y, z, w в том порядке, в котором идут соответствующие им столбцы (сначала  — буква, соответствующая первому столбцу; затем  — буква, соответствующая второму столбцу, и т. д.). Буквы в ответе пишите подряд, никаких разделителей между буквами ставить не нужно.

## Задание  15618
Логическая функция F задаётся выражением (x ∧ ¬y) ∨ (y ≡ z) ∨ ¬w. На рисунке приведён фрагмент таблицы истинности функции F, содержащий все наборы аргументов, при которых функция F ложна. Определите, какому столбцу таблицы истинности функции F соответствует каждая из переменных w, x, y, z. Все строки в представленном фрагменте разные.
```
for x in range(2):
    for y in range(2):
        for z in range(2):
            for w in range(2):
                if ((x and (not y)) or (y == z) or not w) == False:
                    print(x, y, z, w)
```
В ответе напишите буквы w, x, y, z в том порядке, в котором идут соответствующие им столбцы (без разделителей).

## Задание 15970
Логическая функция F задаётся выражением (x ∧ ¬y) ∨ (y ≡ z ) ∨ w. Дан частично заполненный фрагмент, содержащий неповторяющиеся строки таблицы истинности функции F. Определите, какому столбцу таблицы истинности соответствует каждая из переменных x, y, z, w.
```
for x in range(2):
    for y in range(2):
        for z in range(2):
            for w in range(2):
                if not((x and not (y)) or (y == z) or w):
                    print(x, y, z, w)
```
В ответе напишите буквы x, y, z, w в том порядке, в котором идут соответствующие им столбцы (сначала  — буква, соответствующая первому столбцу; затем  — буква, соответствующая второму столбцу, и т. д.). Буквы в ответе пишите подряд, никаких разделителей между буквами ставить не нужно.

## Задание 18614 
Логическая функция F задаётся выражением ((w → ¬x) ≡ (z → y)) ∧ (y ∨ w). Дан частично заполненный фрагмент, содержащий неповторяющиеся строки таблицы истинности функции F. Определите, какому столбцу таблицы истинности соответствует каждая из переменных x, y, z, w.
```
for x in range(2):
    for y in range(2):
        for z in range(2):
            for w in range(2):
                if not (((w <= (not x))) == (z <= y) and (y or w)):
                    print(x, y, z, w)
```
В ответе напишите буквы x, y, z, w в том порядке, в котором идут соответствующие им столбцы (сначала буква, соответствующая первому столбцу; затем буква, соответствующая второму столбцу, и т. д.). Буквы в ответе пишите подряд, никаких разделителей между буквами ставить не нужно.

## Задание 
